Repository: MoonightIce/LockTune
Catalog: App/Localizable.xcstrings
Source language: en
Languages: zh_hans

# calendar.allDay
source: All day
zh_hans: 全天

# calendar.attendance.accepted
source: Accepted
zh_hans: 已接受

# calendar.attendance.declined
source: Declined
zh_hans: 已拒绝

# calendar.attendance.needsAction
source: Response needed
zh_hans: 待回复

# calendar.attendance.tentative
source: Tentative
zh_hans: 暂定

# calendar.attendance.unknown
source: No response status
zh_hans: 无回复状态

# calendar.configurationRequired
source: LockTune Google Desktop OAuth client credentials are required for this build.
zh_hans: 此构建需要配置 LockTune 的 Google 桌面 OAuth 客户端凭据。

# calendar.connect
source: Connect Google Calendar
zh_hans: 连接 Google 日历

# calendar.cancelConnect
source: Cancel connection
zh_hans: 取消连接

# calendar.connecting
source: Complete authorization in your browser.
zh_hans: 请在浏览器中完成授权。

# calendar.chooseCalendars
source: Choose calendars
zh_hans: 选择日历

# calendar.disconnect
source: Disconnect Google Calendar
zh_hans: 断开 Google 日历

# calendar.error.authorization
source: Google authorization did not complete.
zh_hans: Google 授权未完成。

# calendar.error.authorizationExpired
source: Google authorization expired or was revoked. Connect again.
zh_hans: Google 授权已过期或被撤销，请重新连接。

# calendar.error.disconnect
source: The saved Google authorization could not be removed.
zh_hans: 无法移除已保存的 Google 授权。

# calendar.error.notConfigured
source: This build has no Google OAuth client credentials.
zh_hans: 此构建尚未配置 Google OAuth 客户端凭据。

# calendar.error.network
source: Calendar sync could not reach Google. Check your network connection.
zh_hans: 无法连接 Google 同步日历，请检查网络连接。

# calendar.error.invalidResponse
source: Google returned calendar data LockTune could not read.
zh_hans: Google 返回了 LockTune 无法读取的日历数据。

# calendar.error.permission
source: Google rejected access to one of the selected calendars.
zh_hans: Google 拒绝访问某个已选日历。

# calendar.error.rateLimited
source: Google temporarily limited calendar requests. Try again later.
zh_hans: Google 暂时限制了日历请求，请稍后重试。

# calendar.error.service
source: Google Calendar is temporarily unavailable.
zh_hans: Google 日历服务暂时不可用。

# calendar.error.restore
source: The saved Google Calendar connection could not be restored.
zh_hans: 无法恢复已保存的 Google 日历连接。

# calendar.error.sync
source: Calendar sync failed.
zh_hans: 日历同步失败。

# calendar.joinMeet
source: Join Meet
zh_hans: 加入 Meet

# calendar.lastSync
source: Last sync: %@
zh_hans: 上次同步：%@

# calendar.notConfigured
source: Google Calendar is ready after this build receives LockTune's OAuth client credentials.
zh_hans: 配置 LockTune 的 OAuth 客户端凭据后即可连接 Google 日历。

# calendar.noUpcomingEvents
source: No events are scheduled in the selected calendars for the next 14 days.
zh_hans: 所选日历在未来 14 天内没有日程。

# calendar.offlineCache
source: Showing the last offline cache
zh_hans: 正在显示最近的离线缓存

# calendar.openInGoogle
source: Open in Google Calendar
zh_hans: 在 Google 日历中打开

# calendar.refresh
source: Refresh Calendar
zh_hans: 刷新日历

# calendar.untitled
source: Untitled event
zh_hans: 未命名日程

# island.accessibility
source: LockTune island
zh_hans: LockTune 灵动岛

# island.idle
source: Local music and meetings at a glance
zh_hans: 本地音乐与会议信息一目了然

# island.meetingSoon
source: Meeting starts soon
zh_hans: 会议即将开始

# library.addFolder
source: Add Music Folder
zh_hans: 添加音乐文件夹

# library.album
source: Album
zh_hans: 专辑

# library.artist
source: Artist
zh_hans: 艺术家

# library.artworkUnknown
source: Unknown artwork
zh_hans: 未知封面

# library.duration
source: Duration
zh_hans: 时长

# library.error.authorization
source: LockTune could not save read-only access to that folder.
zh_hans: LockTune 无法保存该文件夹的只读访问权限。

# library.error.indexUnavailable
source: The local music index is unavailable. No scan result was saved.
zh_hans: 本地音乐索引不可用，本次扫描结果未保存。

# library.error.restore
source: The saved music library could not be restored.
zh_hans: 无法恢复已保存的音乐库。

# library.error.scan
source: The music scan did not finish. Your files were not changed.
zh_hans: 音乐扫描未完成，原始文件没有被修改。

# library.error.someFoldersUnavailable
source: Some music folders could not be accessed. Their existing index entries were kept.
zh_hans: 部分音乐文件夹无法访问，已有索引内容已保留。

# library.metadataPartial
source: Some metadata is missing
zh_hans: 部分元数据缺失

# library.metadataUnavailable
source: Metadata unavailable
zh_hans: 无法读取元数据

# library.issue.metadataUnavailable
source: metadata unavailable
zh_hans: 无法读取元数据

# library.issue.unreadable
source: file is unreadable
zh_hans: 文件不可读

# library.issue.unsupportedFormat
source: format is not supported in this version
zh_hans: 当前版本不支持此格式

# library.issueCount
source: %lld files need attention
zh_hans: %lld 个文件需要处理

# library.refresh
source: Refresh Library
zh_hans: 刷新音乐库

# library.scan.artwork
source: Preparing album artwork
zh_hans: 正在准备专辑封面

# library.scan.cancel
source: Cancel Scan
zh_hans: 取消扫描

# library.scan.discovering
source: Finding supported audio files
zh_hans: 正在查找支持的音乐文件

# library.scan.indexing
source: Reading metadata and building the index
zh_hans: 正在读取元数据并建立索引

# library.scan.readOnly
source: Source files remain unchanged.
zh_hans: 源文件不会被修改。

# library.scan.saving
source: Saving the local index
zh_hans: 正在保存本地索引

# library.scan.title
source: Updating Music Library
zh_hans: 正在更新音乐库

# library.title
source: Title
zh_hans: 标题

# library.trackNumber
source: Track
zh_hans: 音轨

# library.unknown
source: Unknown
zh_hans: 未知

# library.unknownTitle
source: Unknown Title
zh_hans: 未知标题

# menu.quit
source: Quit LockTune
zh_hans: 退出 LockTune

# placeholder.calendar
source: Connect Google Calendar when you are ready.
zh_hans: 准备好后可连接 Google 日历。

# placeholder.library
source: Choose a music folder to build your local library.
zh_hans: 选择音乐文件夹以建立本地音乐库。

# placeholder.nowPlaying
source: Your queue and playback details will appear here.
zh_hans: 播放队列和详情将在这里显示。

# player.localFirst
source: Local-first music
zh_hans: 本地优先音乐

# player.error.audioOutputUnavailable
source: Audio output is unavailable.
zh_hans: 音频输出当前不可用。

# player.error.cannotOpen
source: This track could not be opened.
zh_hans: 无法打开此音乐文件。

# player.error.decodingFailed
source: Playback stopped because decoding failed.
zh_hans: 解码失败，播放已停止。

# player.next
source: Next
zh_hans: 下一首

# player.playSelected
source: Play Selected
zh_hans: 播放所选音乐

# player.previous
source: Previous
zh_hans: 上一首

# player.retry
source: Retry
zh_hans: 重试

# player.skip
source: Skip
zh_hans: 跳过

# player.nothingPlaying
source: Nothing Playing
zh_hans: 尚未播放

# player.pause
source: Pause
zh_hans: 暂停

# player.play
source: Play
zh_hans: 播放

# player.unavailable
source: Playback is not implemented yet
zh_hans: 播放功能尚未实现

# library.browse
source: Browse library
zh_hans: 浏览音乐库

# library.browse.songs
source: Songs
zh_hans: 歌曲

# library.browse.albums
source: Albums
zh_hans: 专辑

# library.browse.artists
source: Artists
zh_hans: 艺术家

# library.browse.folders
source: Folders
zh_hans: 文件夹

# library.browse.favorites
source: Favorites
zh_hans: 收藏

# library.favorite
source: Add to favorites
zh_hans: 添加到收藏

# library.unfavorite
source: Remove from favorites
zh_hans: 取消收藏

# library.folder
source: Folder
zh_hans: 文件夹

# library.search
source: Search title, artist, album, or folder
zh_hans: 搜索标题、艺术家、专辑或文件夹

# player.shuffle
source: Shuffle
zh_hans: 随机播放

# player.repeat.off
source: Repeat off
zh_hans: 关闭循环

# player.repeat.all
source: Repeat all
zh_hans: 列表循环

# player.repeat.one
source: Repeat one
zh_hans: 单曲循环

# settings.cancel
source: Cancel
zh_hans: 取消

# settings.disconnectConfirmationMessage
source: This removes the saved OAuth token and calendar cache from this Mac. You can reconnect at any time.
zh_hans: 这会从本机移除已保存的 OAuth 令牌和日历缓存；之后可以随时重新连接。

# settings.disconnectConfirmationTitle
source: Disconnect Google Calendar?
zh_hans: 断开 Google 日历？

# settings.musicFolderRemove
source: Remove
zh_hans: 移除

# settings.musicFolderRemoveConfirmation
source: Remove this authorized folder?
zh_hans: 移除这个授权目录？

# settings.musicFolderRemoveMessage
source: LockTune will remove its bookmark and the corresponding rebuildable index entries. Source files remain unchanged.
zh_hans: LockTune 将移除目录书签及对应的可重建索引；源文件不会被修改。

# settings.musicFolders
source: Authorized Music Folders
zh_hans: 已授权音乐目录

# settings.musicFoldersClear
source: Clear All
zh_hans: 全部清除

# settings.musicFoldersClearConfirmation
source: Clear all authorized folders?
zh_hans: 清除所有授权目录？

# settings.musicFoldersClearMessage
source: LockTune will stop scanning, remove every folder bookmark, and clear the rebuildable music index. Source files remain unchanged.
zh_hans: LockTune 将停止扫描、移除全部目录书签并清空可重建音乐索引；源文件不会被修改。

# settings.musicFoldersEmpty
source: No music folders are currently authorized.
zh_hans: 当前没有已授权音乐目录。

# settings.general
source: General
zh_hans: 通用

# settings.googleCalendar
source: Google Calendar
zh_hans: Google 日历

# settings.googleCalendarConnected
source: Connected with read-only access
zh_hans: 已连接，只读访问

# settings.googleCalendarDescription
source: Disconnecting removes the local OAuth token and cached events without modifying Google Calendar.
zh_hans: 断开连接只会移除本机 OAuth 令牌和事件缓存，不会修改 Google 日历。

# settings.googleCalendarDisconnected
source: Not connected
zh_hans: 未连接

# settings.googleCalendarSyncing
source: Syncing calendars
zh_hans: 正在同步日历

# settings.islandEnabled
source: Show LockTune island
zh_hans: 显示 LockTune 灵动岛

# settings.islandDescription
source: Shows playback and imminent meetings at the top of the active display.
zh_hans: 在当前显示器顶部展示播放状态和即将开始的会议。

# settings.glassBlur
source: Background blur
zh_hans: 背景模糊

# settings.glassBoundaryNote
source: Refraction is limited to the view border; content stays clear.
zh_hans: 折射只作用于视图边框，主体内容保持清晰。

# settings.glassContentClear
source: Content stays clear
zh_hans: 内容层不参与折射

# settings.glassMotion
source: Move background highlights
zh_hans: 背景实时移动

# settings.glassRefraction
source: Edge refraction
zh_hans: 边缘折射

# settings.glassTint
source: Tint opacity
zh_hans: 染色透明度

# settings.privacy
source: Privacy
zh_hans: 隐私

# settings.lockScreenPrivacy
source: The island hides when the macOS session locks; calendar details are never sent to the lock screen.
zh_hans: macOS 会话锁定时灵动岛会隐藏；日历详情不会发送到锁屏。

# settings.localOnly
source: Music remains local and read-only. OAuth tokens are stored in Keychain.
zh_hans: 音乐始终保留在本地且只读；OAuth 令牌存储在钥匙串中。

# settings.preview
source: Music folders, Google account, island, and privacy settings arrive in their feature slices.
zh_hans: 音乐目录、Google 账号、灵动岛和隐私设置将在对应功能阶段加入。

# sidebar.calendar
source: Calendar
zh_hans: 日历

# sidebar.library
source: Library
zh_hans: 音乐库

# sidebar.nowPlaying
source: Now Playing
zh_hans: 正在播放
